flxos-labs/flxos/sdkconfig.defaults.esp32_cyd
# ESP32-2432S028R (Cheap Yellow Display / CYD) board preset
# Display: ILI9341 on HSPI, Touch: XPT2046 on Software SPI
# Copy this file to sdkconfig.defaults.esp32 before building.
#
# Reference: https://randomnerdtutorials.com/cheap-yellow-display-esp32-2432s028r/

CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_FILENAME="partitions_4mb.csv"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"

# Display: ILI9341, 240x320
CONFIG_FLXOS_DISPLAY_ILI9341=y
CONFIG_FLXOS_DISPLAY_WIDTH=240
CONFIG_FLXOS_DISPLAY_HEIGHT=320
CONFIG_FLXOS_DISPLAY_ROTATION=90

# Display Bus: SPI (HSPI)
CONFIG_FLXOS_BUS_SPI=y
CONFIG_FLXOS_SPI_HOST=1
CONFIG_FLXOS_SPI_MODE=0
CONFIG_FLXOS_SPI_FREQ_WRITE=40000000
CONFIG_FLXOS_SPI_FREQ_READ=16000000
CONFIG_FLXOS_PIN_SCLK=14
CONFIG_FLXOS_PIN_MOSI=13
CONFIG_FLXOS_PIN_MISO=12
CONFIG_FLXOS_PIN_DC=2

# Display Panel
CONFIG_FLXOS_PIN_CS=15
CONFIG_FLXOS_PIN_RST=-1
CONFIG_FLXOS_PIN_BUSY=-1
CONFIG_FLXOS_BUS_SHARED=n
CONFIG_FLXOS_PANEL_OFFSET_ROTATION=2

# Backlight
CONFIG_FLXOS_PIN_BCKL=21

# Touch: XPT2046 on separate (software) SPI
CONFIG_FLXOS_TOUCH_ENABLED=y
CONFIG_FLXOS_TOUCH_XPT2046=y
CONFIG_FLXOS_TOUCH_SPI_FREQ=1000000
CONFIG_FLXOS_TOUCH_SPI_SEPARATE_PINS=y
CONFIG_FLXOS_TOUCH_SPI_HOST=-1
CONFIG_FLXOS_PIN_TOUCH_SCLK=25
CONFIG_FLXOS_PIN_TOUCH_MOSI=32
CONFIG_FLXOS_PIN_TOUCH_MISO=39
CONFIG_FLXOS_PIN_TOUCH_CS=33
CONFIG_FLXOS_PIN_TOUCH_INT=-1
CONFIG_FLXOS_TOUCH_BUS_SHARED=n

# Touch Calibration (CYD defaults)
CONFIG_FLXOS_TOUCH_X_MIN=300
CONFIG_FLXOS_TOUCH_X_MAX=3900
CONFIG_FLXOS_TOUCH_Y_MIN=3700
CONFIG_FLXOS_TOUCH_Y_MAX=200
CONFIG_FLXOS_TOUCH_OFFSET_ROTATION=0

# SD Card (Shared HSPI bus, CS=GPIO5)
CONFIG_FLXOS_SD_CARD_ENABLED=y
CONFIG_FLXOS_SD_MOUNT_POINT="/sdcard"
CONFIG_FLXOS_SD_PIN_CS=5
CONFIG_FLXOS_SD_PIN_MOSI=-1
CONFIG_FLXOS_SD_PIN_MISO=-1
CONFIG_FLXOS_SD_PIN_SCLK=-1
CONFIG_FLXOS_SD_SPI_HOST=1
CONFIG_FLXOS_SD_MAX_FREQ_KHZ=4000
